art/note/j07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-17 Mon 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org880910d">1. Set 和 List</a>
<ul>
<li><a href="#org5f6c27a">1.1. Array List</a></li>
<li><a href="#org6b81f85">1.2. LinkedList 类</a></li>
<li><a href="#orgd5faa5c">1.3. Let us ask Bing!</a></li>
</ul>
</li>
<li><a href="#orgbf4321c">2. Set 和 Map 接口</a>
<ul>
<li><a href="#orgbeb5a5f">2.1. HashSet</a></li>
<li><a href="#orgf0cd9df">2.2. Let us ask Bing!</a></li>
</ul>
</li>
<li><a href="#org7e7267d">3. 策略模式 (Strategy Pattern)</a>
<ul>
<li><a href="#org78399ee">3.1. 策略模式适用于以下情况：</a></li>
<li><a href="#org90340d8">3.2. 优点和缺点</a></li>
<li><a href="#orgb4665bf">3.3. 总结</a></li>
</ul>
</li>
<li><a href="#org3d6376d">4. 迭代器模式</a>
<ul>
<li><a href="#orge836b1c">4.1. 一个例子</a></li>
<li><a href="#orge72a884">4.2. Aggregate</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org880910d" class="outline-2">
<h2 id="org880910d"><span class="section-number-2">1</span> Set 和 List</h2>
<div class="outline-text-2" id="text-1">
<p>
Set和List都是Java集合框架中的接口，它们都可以用来存储一组元素。但是，
它们之间有一些重要的区别：
</p>

<p>
元素唯一性：Set接口中的元素是唯一的，也就是说，同一个元素只能在Set中出
现一次。而List接口允许重复的元素。
</p>

<p>
元素顺序：List接口中的元素是有序的，也就是说，元素在List中的顺序是固定
的。而Set接口中的元素是无序的。
</p>

<p>
索引：List接口支持索引，可以通过索引来访问、插入、删除元素。而Set接口
不支持索引。
</p>

<p>
这些区别决定了Set和List在实际应用中的不同用途。例如，如果需要存储一组
不重复的元素，并且不关心元素顺序，那么可以使用Set；如果需要存储一组可
能重复的元素，并且需要保持元素顺序，那么可以使用List。
</p>

<p>
Set 有两种(至少)类, 分别为 <code>HashSet</code> 和 <code>TreeSet</code>.
List有两种(至少)类, 分别为 <code>ArrayList</code> 和 <code>LinkedList</code>.
</p>
</div>

<div id="outline-container-org5f6c27a" class="outline-3">
<h3 id="org5f6c27a"><span class="section-number-3">1.1</span> Array List</h3>
<div class="outline-text-3" id="text-1-1">
<p>
我们初始化的时候可以用这样的语句
</p>

<p>
<code>ArrayList&lt;E&gt; list = new ArrayList&lt;&gt;();</code>
</p>

<p>
其中 <code>&lt;&gt;</code> 所包围的便是类的名称. 
</p>
</div>
</div>

<div id="outline-container-org6b81f85" class="outline-3">
<h3 id="org6b81f85"><span class="section-number-3">1.2</span> LinkedList 类</h3>
<div class="outline-text-3" id="text-1-2">
<p>
LinkedList 是一个已经封装好了的 <b>双向链表</b>. 
</p>
</div>
</div>

<div id="outline-container-orgd5faa5c" class="outline-3">
<h3 id="orgd5faa5c"><span class="section-number-3">1.3</span> Let us ask Bing!</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Q: LinkedList 和 ArrayList 之间有什么区别? 
</p>

<p>
A: LinkedList和ArrayList都是Java集合框架中的List接口的实现类，它们都可
以用来存储一组有序的元素。但是，它们之间有一些重要的区别：
</p>

<p>
内部实现：ArrayList是基于动态数组实现的，而LinkedList是基于双向链表实
现的。
</p>

<p>
插入和删除操作：由于LinkedList是基于链表实现的，所以在链表的头部或尾部
插入或删除元素的时间复杂度为O(1)。但是，在链表中间插入或删除元素需要先
找到对应位置，时间复杂度为O(n)。而ArrayList是基于数组实现的，所以在数
组末尾插入或删除元素的时间复杂度为O(1)，但是在数组中间插入或删除元素需
要移动元素，时间复杂度为O(n)。
</p>

<p>
随机访问操作：由于ArrayList是基于数组实现的，所以它支持快速随机访问，
时间复杂度为O(1)。而LinkedList不支持快速随机访问，需要从头或尾遍历链表
来访问指定位置的元素，时间复杂度为O(n)。
</p>

<p>
这些区别决定了LinkedList和ArrayList在实际应用中的不同用途。例如，如果
需要频繁在列表头部或尾部插入或删除元素，那么可以使用LinkedList；如果需
要频繁随机访问列表中的元素，那么可以使用ArrayList。
</p>
</div>
</div>
</div>


<div id="outline-container-orgbf4321c" class="outline-2">
<h2 id="orgbf4321c"><span class="section-number-2">2</span> Set 和 Map 接口</h2>
<div class="outline-text-2" id="text-2">
<p>
Map 是 Java 集合框架中的一个接口，它用于存储键值对（key-value pairs）。
Map 中的每个元素都包含一个键和一个值，可以通过键来访问、插入、删除元素。
</p>

<p>
Map 中的键是唯一的，也就是说，同一个键只能在 Map 中出现一次。但是，不
同的键可以映射到相同的值。
</p>

<p>
Map 接口提供了一些方法来操作键值对，例如 <code>put(key, value)</code> 用于插入或
更新一个键值对，get(key)用于根据键来获取对应的值，remove(key)用于删除
指定键的键值对。
</p>

<p>
Java提供了几种常用的Map实现，包括HashMap、TreeMap、LinkedHashMap等。这
些实现之间有一些区别，例如HashMap是无序的，TreeMap是有序的，
LinkedHashMap保持了插入顺序。
</p>
</div>

<div id="outline-container-orgbeb5a5f" class="outline-3">
<h3 id="orgbeb5a5f"><span class="section-number-3">2.1</span> HashSet</h3>
<div class="outline-text-3" id="text-2-1">
<p>
HashSet 不是线程安全的, 如果说有多个线程尝试同时修改 HashSet, 则其最终
结果是不确定的. 这个时候, 我们需要在多线程访问的时候 <span class="underline">显式同步</span> 对 HashSet
的并发访问. 
</p>
</div>
</div>

<div id="outline-container-orgf0cd9df" class="outline-3">
<h3 id="orgf0cd9df"><span class="section-number-3">2.2</span> Let us ask Bing!</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Q: Tell me about HashSet and TreeSet
</p>

<p>
A: HashSet和TreeSet都是Java集合框架中的Set接口的实现类，它们都可以用来
存储一组不重复的元素。但是，它们之间有一些重要的区别：
</p>

<ol class="org-ol">
<li>内部实现：HashSet是基于哈希表实现的，而TreeSet是基于红黑树实现的。</li>
<li>元素顺序：HashSet中的元素是无序的，而TreeSet中的元素是有序的。
TreeSet 中的元素按照自然顺序或者指定的比较器进行排序。</li>
<li>时间复杂度：由于HashSet是基于哈希表实现的，所以它支持O(1)时间复杂度
的添加、删除和查找操作。而TreeSet是基于红黑树实现的，所以它支持
O(log n) 时间复杂度的添加、删除和查找操作。</li>
</ol>

<p>
这些区别决定了HashSet和TreeSet在实际应用中的不同用途。例如，如果需要快
速添加、删除和查找元素，并且不关心元素顺序，那么可以使用HashSet；如果
需要存储一组有序的不重复元素，那么可以使用TreeSet。
</p>
</div>
</div>
</div>


<div id="outline-container-org7e7267d" class="outline-2">
<h2 id="org7e7267d"><span class="section-number-2">3</span> 策略模式 (Strategy Pattern)</h2>
<div class="outline-text-2" id="text-3">
<p>
策略模式（Strategy Pattern）是一种常用的行为设计模式，它允许在运行时根
据需要选择算法或策略。它定义了一系列算法，将每个算法封装起来，并使它们
之间可以互相替换。这样，算法的变化不会影响到使用算法的客户端。
</p>

<p>
策略模式通常由三部分组成：上下文（Context）、策略接口（Strategy）和具
体策略（Concrete Strategy）。上下文负责维护一个对策略接口的引用，客户
端可以通过上下文来选择和使用具体策略。策略接口定义了所有支持的算法的公
共接口，具体策略实现了策略接口，并提供了具体的算法实现。
</p>

<p>
值得注意的是, Context 是什么? Context 是一个策略的封装, 里面维护了一个
策略接口的实例. Context 到底哪个层级, 我们可以从一个角度切入, 我们要调
用 Context 类的一个 <code>setStrategy</code> 方法来切换 <code>Stra</code>, 那么说, 需要切换
方法的类, 的内部, 应该有一个 Context 的实例. 
</p>
</div>

<div id="outline-container-org78399ee" class="outline-3">
<h3 id="org78399ee"><span class="section-number-3">3.1</span> 策略模式适用于以下情况：</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li>当您有一组相关的算法，并且需要在运行时根据需要选择其中一个算法时，
可以使用策略模式。例如，在上面的例子中，我们有三种不同的折扣计算策
略，可以根据用户类型在运行时选择相应的折扣计算策略。</li>

<li>当您需要避免使用多重条件语句（例如if-else或switch-case）来选择算法
时，可以使用策略模式。使用策略模式可以将每个算法封装在一个单独的类
中，从而避免了多重条件语句。</li>

<li>当您需要能够在运行时更改算法或策略时，可以使用策略模式。例如，在上
面的例子中，我们可以在运行时更改购物车的折扣计算策略。</li>
</ol>

<p>
总之，当您需要在一组相关的算法中进行选择，并且希望能够在运行时更改选择
时，可以考虑使用策略模式。
</p>
</div>
</div>

<div id="outline-container-org90340d8" class="outline-3">
<h3 id="org90340d8"><span class="section-number-3">3.2</span> 优点和缺点</h3>
<div class="outline-text-3" id="text-3-2">
<p>
当然可以，这个模式有以下几个优点：
</p>

<ol class="org-ol">
<li>可以提高代码的灵活性和可扩展性。通过将算法或行为抽象为一个接口或抽
象类，并实现不同的具体策略类，我们可以在运行时动态地切换算法或行为，
而无需更改客户端代码，从而使代码更加灵活和可扩展。</li>
<li>可以降低代码重复率。通过使用该模式，我们可以将相关的算法或行为封装
到单独的策略类中，避免了代码中的重复逻辑。</li>
<li>可以隐藏具体实现细节。通过向客户端暴露一个统一的接口或抽象类，该模
式可以将具体实现细节隐藏起来，使得客户端不需要知道具体算法或行为的
实现方式。</li>
<li>可以方便地添加新的策略。如果需要添加新的算法或行为，只需要实现一个
新的具体策略类即可，而无需更改原有的代码。总之，Strategy模式是一种
非常有用的设计模式，可以帮助我们编写更加灵活、可扩展、可维护的代码。</li>
</ol>

<p>
策略模式的主要缺点是：
</p>

<ol class="org-ol">
<li>客户端需要了解所有的策略类，并且需要知道如何选择合适的策略。这增加
了客户端的复杂性。</li>

<li>策略模式会增加许多策略类，每个具体策略都需要一个单独的类来实现。如
果有许多不同的策略，那么这会导致类数量的增加，增加了维护成本。</li>

<li>策略模式通常需要使用上下文来维护对策略对象的引用。如果上下文需要支
持许多不同的策略，那么这会导致上下文类变得复杂。</li>
</ol>

<p>
尽管策略模式有这些缺点，但它仍然是一种非常有用的设计模式。它可以提供一
种松耦合的方式来管理一组相关的算法，并且可以在运行时更改算法。
</p>
</div>
</div>

<div id="outline-container-orgb4665bf" class="outline-3">
<h3 id="orgb4665bf"><span class="section-number-3">3.3</span> 总结</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">模式名字</td>
<td class="org-left">Strategy Pattern</td>
</tr>

<tr>
<td class="org-left">目的</td>
<td class="org-left">在多种算法类似的情况, 避免多个 if 语句带来的重复和复杂</td>
</tr>

<tr>
<td class="org-left">问题</td>
<td class="org-left">让算法和使用算法的对象分开</td>
</tr>

<tr>
<td class="org-left">解决方法</td>
<td class="org-left">将算法封装起来, 在这个封装内切换算法</td>
</tr>

<tr>
<td class="org-left">效果</td>
<td class="org-left">1. 策略可以自由切换 2. 扩展性良好</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-org3d6376d" class="outline-2">
<h2 id="org3d6376d"><span class="section-number-2">4</span> 迭代器模式</h2>
<div class="outline-text-2" id="text-4">
<p>
迭代器模式（Iterator Pattern）是一种常用的行为设计模式，它提供了一种顺
序访问集合对象中的元素的方法，而无需暴露集合对象的内部表示。
</p>

<p>
迭代器模式通常由三部分组成：容器（Container）、迭代器接口（Iterator）
和具体迭代器（Concrete Iterator）。容器负责维护元素集合，并提供一个方
法来创建迭代器。迭代器接口定义了访问元素的方法，例如hasNext()和next()。
具体迭代器实现了迭代器接口，并提供了具体的访问元素的方法。
</p>

<p>
迭代器模式的优点在于它可以提供一种统一的方式来访问不同类型的集合对象。
客户端只需要知道如何使用迭代器，而不需要关心集合对象的内部实现细节。此
外，由于具体迭代器是独立的，所以可以方便地添加、删除或更改具体迭代器。
</p>

<p>
举个例子，假设我们正在开发一个图书馆系统，需要管理一组图书。我们可以使
用迭代器模式来实现这个功能。首先，定义一个图书馆类（Library），用来维
护图书集合，并提供一个方法来创建图书迭代器。然后，定义一个图书迭代器接
口（BookIterator），并为图书馆类实现一个具体的图书迭代器
（LibraryBookIterator）。最后，在客户端中使用图书迭代器来访问图书馆中
的图书。
</p>
</div>

<div id="outline-container-orge836b1c" class="outline-3">
<h3 id="orge836b1c"><span class="section-number-3">4.1</span> 一个例子</h3>
<div class="outline-text-3" id="text-4-1">
<p>
首先，定义一个图书馆类（Library），用来维护图书集合，并提供一个方法来
创建图书迭代器：
</p>

<pre class="example">
import java.util.ArrayList;
import java.util.List;

class Library {
    private List&lt;String&gt; books;

    public Library() {
        // initialize
        books = new ArrayList&lt;&gt;();
    }

    public void addBook(String book) {
        books.add(book);
    }

    public BookIterator createIterator() {
        return new LibraryBookIterator(this);
    }

    public List&lt;String&gt; getBooks() {
        return books;
    }
}
</pre>

<p>
然后，定义一个图书迭代器接口（BookIterator），并为图书馆类实现一个具体
的图书迭代器（LibraryBookIterator）：
</p>

<pre class="example">
interface BookIterator {
    boolean hasNext();
    String next();
}

class LibraryBookIterator implements BookIterator {
    private Library library;
    private int index;

    public LibraryBookIterator(Library library) {
        this.library = library;
        this.index = 0;
    }

    public boolean hasNext() {
        // tell if the index have next index.
        return index &lt; library.getBooks().size();
    }

    public String next() {
        // get next
        String book = library.getBooks().get(index);
        // get(index) is a method in the class ArrayList.
        index++;
        return book;
    }
}
</pre>

<p>
最后，在客户端中使用图书迭代器来访问图书馆中的图书：
</p>

<pre class="example">
// 客户端代码
// 创建一个 library
Library library = new Library();
// 塞入三本书
library.addBook("The Great Gatsby");
library.addBook("To Kill a Mockingbird");
library.addBook("One Hundred Years of Solitude");
// 获取 iterator
BookIterator iterator = library.createIterator();
while (iterator.hasNext()) {
    // 打印出所有书名.
    String book = iterator.next();
    System.out.println(book);
}
</pre>

<p>
在这个例子中，客户端只需要知道如何使用图书迭代器，而不需要关心图书馆是
如何存储图书的。此外，由于具体图书迭代器是独立的，所以可以方便地添加、
删除或更改具体图书迭代器。
</p>
</div>
</div>

<div id="outline-container-orge72a884" class="outline-3">
<h3 id="orge72a884"><span class="section-number-3">4.2</span> Aggregate</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在迭代器模式中，聚合（Aggregate）是指一个包含一组元素的对象，它提供了
一种方法来创建迭代器，以便客户端可以顺序访问其中的元素。
</p>

<p>
聚合通常是一个容器，它负责维护元素集合。例如，在上面的例子中，图书馆类
（Library）就是一个聚合，它维护了一组图书，并提供了一个方法来创建图书
迭代器。
</p>

<p>
聚合不需要暴露其内部表示，客户端只需要知道如何使用迭代器来访问其中的元
素。这样，当聚合的内部实现发生变化时，客户端代码不需要做任何修改。</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-04-17 Mon 15:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>